{
  "basics": {
    "name": "Evert Pot",
    "label": "Technical Leadership / API specialist",
    "email": "work@evertpot.com",
    "url": "https://evertpot.com/",
    "summary": "I’m 20 year software engineering veteran and co-founded several businesses.\n\nI’m currently on the look-out for new opportunities. I’m especially interested in CTO and Director or part-time advisor positions.",
    "location": {
      "city": "Toronto",
      "countryCode": "CA",
      "region": "Ontario"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "evert",
        "url": "https://github.com/evert"
      },
      {
        "network": "Mastodon",
        "username": "@evert@indieweb.social",
        "url": "https://indieweb.social/@evert"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/evert-pot/"
      },
      {
        "network": "Twitter",
        "username": "@evertp",
        "url": "https://twitter.com/evertp"
      }
    ]
  },
  "work": [
    {
      "name": "Bad Gateway",
      "location": "Toronto",
      "position": "Founder/CEO",
      "startDate": "2019",
      "endDate": "2023",
      "summary": "In June 2019 I founded a software development agency in Toronto. Our team built Web Applications and APIs for clients in a variety of industries.\n\nThis company eventually grew to 7 employees. We worked for for a variety of customers, including start-ups, media companies and financial institutions."
    },
    {
      "name": "OrderUp",
      "location": "Toronto",
      "position": "Technical Advisor",
      "url": "https://www.orderup.ai/",
      "startDate": "2018",
      "endDate": "2022",
      "summary": "At OrderUp I helped the engineering tool develop processes, work through technical issues and help architect their system through inception until their eventual aquisition."
    },
    {
      "name": "Ascendant Digital",
      "location": "Cayman Islands/Toronto",
      "position": "Software Engineer",
      "startDate": "2018",
      "endDate": "2020",
      "summary": "Ascendant Digital is a private investment firm.\n\nMy role was to develop tools to help the company analyze the market, to build a system for tracking performance and reconsilation of different investment strategies and advise on information security.\n\nTo do this, I’ve built REST apis (primarily HAL) in Node.js and Typescript, browser-based frontends using React, integrations with tools such as Google Sheets and Dropbox and various serverless processes using the AWS ecosystem.\n\nInitially I joined the team as a full-time position, but as my services became less necessary, my role became a fractional position allowing me to start my own agency."
    },
    {
      "name": "Yelp",
      "location": "San Francisco",
      "position": "Technical Lead",
      "url": "https://www.yelp.com/",
      "startDate": "2016",
      "endDate": "2018",
      "summary": "In October 2016, I joined Turnstyle, a company in Toronto that does location-based marketing analytics.\n\nMy role there was to help drive the design and architecture of a REST API. We’ve used HAL, OAuth2, json-schema to drive the hypermedia API using NodeJS, ES6, ES7. On a docker-container infrastructure running on Amazon Web Services. I also helped mentor other developers and act as a technical lead.\n\nIn April 2017 Turnstyle got acquired by Yelp, and I subsequently moved to San Francisco in October 2017.\n\nThere I helped onboard a quickly growing development team and working with the needs and requirements of a much larger corporation, including integrating our existing systems and culture with Yelp’s."
    },
    {
      "name": "Fruux",
      "location": "Germany/UK",
      "position": "Co-Founder/CTO",
      "startDate": "2011",
      "endDate": "2015",
      "summary": "In December 2011 I went full-time with fruux, which was a bit of a side-project at the time. We got a seed investment round and opened the door to our office. As the technical lead I’ve been responsible for the technical and product direction, as well as leading the team from a technical perspective. Aside from that I’ve also got my hands dirty in some marketing and sales and just stepped in where needed.\n\nAs a programmer I helped develop their synchronization system for personal information such as calendars, contacts and files. I acted as a liaison for the CalConnect calendar and scheduling standard consortium."
    },
    {
      "name": "Ibuildings",
      "location": "Utrecht, Netherlands",
      "position": "Senior Software Engineer",
      "url": "https://ibuildings.com/",
      "startDate": "2010",
      "endDate": "2011",
      "summary": "In 2010 I started working for Ibuildings in the Netherlands as a senior software engineer. Ibuildings is a software development company based in The Netherlands and London, UK specializing in PHP and other web-related technologies. My role was primarily in leading development teams, training and development. I’ve worked here on scalability issues for nu.nl (the number one Dutch news site), designed Javascript/YUI3 based ‘fat’ javascript clients, (RESTful) Web-service development and in-house training around subjects such as web-services design and a full-day javascript workshop.",
      "highlights": []
    },
    {
      "name": "Filemobile",
      "location": "Toronto, Canada",
      "position": "Lead Architect/owner",
      "startDate": "2006",
      "endDate": "2014",
      "summary": "After working with Filemobile as a contractor, I took on the job as lead architect. Being the first person on the payroll, I was given the task of making both the application and business scalable by hiring and managing new engineers and putting development processes in place. For Filemobile, I developed a scalable social network and user-generated content whitelabel engine, working with Canada’s leading media brands such as CBC, CTV, Fox, TSN and CP24.\n\nIn this job I worked with PHP, complicated multi-master, MySQL setups (with geographic redundancy), Memcached, Amazon S3 and EC2 and I was responsible for developing a multi-core, multi-machine transcoding engine as well as leading the development team. Starting August 2009 I resigned as lead architect to continue my work as independent consultant, after that I was still involved in an advisory role and owner.\n\nIn late 2015 the company was sold to NewZulu, an Australian-based media company."
    },
    {
      "name": "Collab",
      "location": "Toronto, Canada",
      "position": "Senior Web Developer/partner",
      "startDate": "2004",
      "endDate": "2006",
      "summary": "Together with Collab I’ve got a taste of many experimental innovative software, such as real-time, multi-user rich internet applications including web video chat and media conversion. Using technologies such as Flash Communication Server (now Flash Media Server) and FFMpeg. In these 3 years I’ve worked with Dutch media and internet companies, such as NOS, BNN, Telegraaf/Speurders.nl, EasyConcepts, Netmasters and UDC/Dancevalley."
    },
    {
      "name": "V/d Veer",
      "location": "Surhuisterveen, The Netherlands",
      "position": "Application Developer",
      "startDate": "2003",
      "endDate": "2003",
      "summary": "Developed and implemented a car inventory and lease database. The Database was based on Interbase, the front-end was built using Borland Delphi. I got this job as an intern. I was forced to jump in and learn many technologies that were new for me at the time, such as SQL."
    }
  ],
  "awards": [
    {
      "title": "Best developer of the year",
      "date": "2008",
      "awarder": "Canadian New Media Awards 2008"
    }
  ],
  "skills": [
    {
      "name": "Software development",
      "level": "Expert",
      "keywords": ["HTTP", "Node.js", "Typescript", "AWS", "React", "HATEOAS", "REST", "Javascript", "OAuth2", "HTML5", "MySQL", "CSS", "Linux", "Docker"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Dutch",
      "fluency": "Fluent"
    },
    {
      "language": "Frisian",
      "fluency": "Fluent"
    }
  ],
  "projects": [
    {
      "name": "Ketting",
      "description": "A general-purpose hypermedia client for Javascript",
      "keywords": ["HATEOAS", "REST", "HTTP", "Hypermedia", "Typescript", "Node", "React"],
      "startDate": "2016",
      "url": "https://github.com/badgateway/ketting",
      "type": "Open source library"
    },
    {
      "name": "Curveball",
      "description": "A modern Node.js framework",
      "keywords": ["Node", "Typescript", "Framework", "HTTP"],
      "startDate": "2018",
      "url": "https://curveballjs.org/",
      "type": "Open source library"
    },
    {
      "name": "a12n-server",
      "description": "OAuth2 server that doesn't have a good name yet",
      "keywords": ["OAuth2", "authentication", "OICD", "TOTP", "WebauthN"],
      "startDate": "2018",
      "url": "https://github.com/curveball/a12n-server",
      "type": "Open source application"
    },
    {
      "name": "My Blog",
      "startDate": "2006",
      "url": "https://github.com/badgateway/ketting",
      "type": "Blog"
    },
    {
      "name": "oauth2-client",
      "description": "OAuth2 client for Node and browsers",
      "keywords": ["OAuth2", "typescript", "javascript"],
      "startDate": "2019",
      "url": "https://github.com/badgateway/oauth2-client",
      "type": "Open source library"
    },
    {
      "name": "sabre/dav",
      "description": "CalDAV, CardDAV and WebDAV server for PHP",
      "startDate": "2007",
      "url": "https://sabre.io/",
      "keywords": ["PHP", "CalDAV", "WebDAV", "CardDAV"],
      "type": "Open source library"
    }
  ] 
}
